"""
位运算符：按位运算符是把数字看做二进制数来进行计算
"""
# & 按位与运算符
# 5 = 0101 7 = 0111
"""
0101
0111
----
0101 = 5
相应的位数都为1，则该位的结果是1，否则为零
"""
print(5 & 7)
# | 按位或运算符
# 5 = 0101 7 = 0111
"""
0101
0111
----
0111 = 7
两个二进制位有一位为1时，结果是1，否则为零
"""
print(5 | 7)
# ^按位异或运算符
# 5 = 0101 7 = 0111
"""
0101
0111
----
0010 = 2
二进制的两位相异时，结果是1，否则为零
"""
print(5 ^ 7)
# ~按位取反
# 5 = 0101
"""
00000000 00000000 00000000 00000101
-----------------------------------
11111111 11111111 11111111 11111010（补码）
10000000 00000000 00000000 00000101 (反码）
10000000 00000000 00000000 00000110 (原码）
= - 6
每个二进制数据位取反，1变0,0变1
"""
print(~5)

"""
<< 左移动运算符
二进制全部左移动若干位，由<<右侧的数字决定移动位数，高位丢弃，低位补零
"""
"""
2 = 00000010
<<2 = 00001000
"""
print(2 << 2)

"""
>> 左移动运算符
二进制全部右移动若干位，由>>右侧的数字决定移动位数
"""
"""
13 = 00001101
<<2 = 00000011
"""
print(13 >> 2)
print(-13 >> 2)